## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (10 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "SOPS"
                                property = "data.SOPS"
                            }
                            secretKey = "SOPS"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITLAB_TOKEN"
                              + property = "data.GITLAB_TOKEN"
                            }
                          + secretKey = "GITLAB_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (10 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "SOPS"
                                metadataPolicy     = "None"
                                property           = "data.SOPS"
                                version            = null
                            }
                            secretKey = "SOPS"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "GITLAB_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.GITLAB_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "GITLAB_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.harbor[0].random_password.admin_password[0] will be created
  + resource "random_password" "admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.harbor[0].vault_kv_secret_v2.harbor_database will be created
  + resource "vault_kv_secret_v2" "harbor_database" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "kv"
      + name                = "cluster-secret-store/secrets/HARBOR_DB"
      + path                = (known after apply)

      + custom_metadata (known after apply)
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/GITLAB_TOKEN"] will be created
  + resource "vault_kv_secret_v2" "initial_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "kv"
      + name                = "cluster-secret-store/secrets/GITLAB_TOKEN"
      + path                = (known after apply)

      + custom_metadata (known after apply)
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/KUBECONFIG"] will be updated in-place
  ~ resource "vault_kv_secret_v2" "initial_secrets" {
      ~ data_json           = (sensitive value)
        id                  = "kv/data/cluster-secret-store/secrets/KUBECONFIG"
        name                = "cluster-secret-store/secrets/KUBECONFIG"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/SOPS"] will be created
  + resource "vault_kv_secret_v2" "initial_secrets" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = false
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "kv"
      + name                = "cluster-secret-store/secrets/SOPS"
      + path                = (known after apply)

      + custom_metadata (known after apply)
    }

  # module.harbor[0].module.credentials.kubernetes_secret.this[0] will be created
  + resource "kubernetes_secret" "this" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "harbor-credentials"
          + namespace        = "harbor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.harbor[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "harbor"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "harbor"
      + namespace                  = "harbor"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.goharbor.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 1200
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "1.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.harbor[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "harbor"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                      + {
                          + remoteRef = {
                              + key      = "GITLAB_TOKEN"
                              + property = "data.GITLAB_TOKEN"
                            }
                          + secretKey = "GITLAB_TOKEN"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "REDIS"
                                metadataPolicy     = "None"
                                property           = "data.REDIS_PASSWORD"
                                version            = null
                            }
                            secretKey = "REDIS_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "GITLAB_TOKEN"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.GITLAB_TOKEN"
                              + version            = (known after apply)
                            }
                          + secretKey = "GITLAB_TOKEN"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.fluent[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "fluent"
      ~ metadata                   = [
          - {
              - app_version    = "3.2.8"
              - chart          = "fluent-bit"
              - first_deployed = 1742557965
              - last_deployed  = 1742594261
              - name           = "fluent"
              - namespace      = "default"
              - notes          = <<-EOT
                    Get Fluent Bit build information by running these commands:
                    
                    export POD_NAME=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=fluent-bit,app.kubernetes.io/instance=fluent" -o jsonpath="{.items[0].metadata.name}")
                    kubectl --namespace default port-forward $POD_NAME 2020:2020
                    curl http://127.0.0.1:2020
                EOT
              - revision       = 8
              - values         = jsonencode(
                    {
                      - config     = {
                          - filters = <<-EOT
                                [FILTER]
                                    Name                kubernetes
                                    Match               kube.*
                                    Kube_URL            https://kubernetes.default.svc:443
                                    Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                                    Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                                    Kube_Tag_Prefix     kube.var.log.containers.
                                    Merge_Log           On
                                    Merge_Log_Key       log_processed
                                    K8S-Logging.Parser  On
                                    K8S-Logging.Exclude Off
                                    
                                [FILTER]
                                    Name                record_modifier
                                    Match               *
                                    Record              log_format structured
                                    
                                [FILTER]
                                    Name                lua
                                    Match               kube.var.log.containers.trace-demo*
                                    Script              /fluent-bit/scripts/extract_trace_id.lua
                                    Call                extract_trace_id
                                
                                [FILTER]
                                    Name                lua
                                    Match               kube.*
                                    Script              /fluent-bit/scripts/filter_health_checks.lua
                                    Call                filter_health_checks
                            EOT
                          - inputs  = <<-EOT
                                [INPUT]
                                    Name              tail
                                    Tag               kube.*
                                    Path              /var/log/containers/*.log
                                    Parser            docker
                                    DB                /var/log/flb_kube.db
                                    Mem_Buf_Limit     5MB
                                    Skip_Long_Lines   On
                                    Refresh_Interval  10
                            EOT
                          - outputs = <<-EOT
                                [OUTPUT]
                                    Name                   loki
                                    Match                  *
                                    Host                   loki.fullstack.pw
                                    Port                   443
                                    TLS                    On
                                    Labels                 job=fluentbit,cluster=tools
                                    Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
                                    Remove_Keys            stream
                                    Auto_Kubernetes_Labels On
                                    Line_Format            json
                            EOT
                        }
                      - luaScripts = {
                          - "extract_trace_id.lua"     = <<-EOT
                                function extract_trace_id(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if type(log) == "string" then
                                        -- Try to extract trace ID using pattern matching
                                        local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                        
                                        if trace_id then
                                            -- Add the trace ID as a new field
                                            record["trace_id"] = trace_id
                                        end
                                    end
                                    
                                    return 1, timestamp, record
                                end
                            EOT
                          - "filter_health_checks.lua" = <<-EOT
                                function filter_health_checks(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if log ~= nil and string.match(string.lower(log), "health check") then
                                        return -1, timestamp, record
                                    end
                                    
                                    return 2, timestamp, record
                                end
                            EOT
                        }
                    }
                )
              - version        = "0.48.9"
            },
        ] -> (known after apply)
        name                       = "fluent"
      ~ values                     = [
          ~ <<-EOT
                luaScripts:
                    extract_trace_id.lua: |
                        function extract_trace_id(tag, timestamp, record)
                            local log = record["log"]
                            
                            if type(log) == "string" then
                                -- Try to extract trace ID using pattern matching
                                local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                
                                if trace_id then
                                    -- Add the trace ID as a new field
                                    record["trace_id"] = trace_id
                                end
                            end
                            
                            return 1, timestamp, record
                        end
                    filter_health_checks.lua: |
                        function filter_health_checks(tag, timestamp, record)
                            local log = record["log"]
                            
                            if log ~= nil and string.match(string.lower(log), "health check") then
                                return -1, timestamp, record
                            end
                            
                            return 2, timestamp, record
                        end
                config:
                  inputs: |
                    [INPUT]
                        Name              tail
                        Tag               kube.*
                        Path              /var/log/containers/*.log
                        Parser            docker
                        DB                /var/log/flb_kube.db
                        Mem_Buf_Limit     5MB
                        Skip_Long_Lines   On
                        Refresh_Interval  10
                
                  filters: |
                    [FILTER]
                        Name                kubernetes
                        Match               kube.*
                        Kube_URL            https://kubernetes.default.svc:443
                        Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                        Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                        Kube_Tag_Prefix     kube.var.log.containers.
                        Merge_Log           On
                        Merge_Log_Key       log_processed
                        K8S-Logging.Parser  On
                        K8S-Logging.Exclude Off
                        
                    [FILTER]
                        Name                record_modifier
                        Match               *
                        Record              log_format structured
                        
                    [FILTER]
                        Name                lua
                        Match               kube.var.log.containers.trace-demo*
                        Script              /fluent-bit/scripts/extract_trace_id.lua
                        Call                extract_trace_id
                
                    [FILTER]
                        Name                lua
                        Match               kube.*
                        Script              /fluent-bit/scripts/filter_health_checks.lua
                        Call                filter_health_checks
                
                  outputs: |
                    [OUTPUT]
                        Name                   loki
                        Match                  *
                        Host                   loki.fullstack.pw
                        Port                   443
                        TLS                    On
                        Labels                 job=fluentbit,cluster=tools
              -         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
              +         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app'],$trace_id
                        Remove_Keys            stream
                        Auto_Kubernetes_Labels On
                        Line_Format            json
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  